# Explore Dataset

## Open University Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
assessments_data_frame = pd.read_csv('anonymisedOUDataSet/assessments.csv')
courses_data_frame = pd.read_csv('anonymisedOUDataSet/courses.csv')
student_assessments_data_frame = pd.read_csv('anonymisedOUDataSet/studentAssessment.csv')
student_info_data_frame = pd.read_csv('anonymisedOUDataSet/studentInfo.csv')
student_registration_data_frame = pd.read_csv('anonymisedOUDataSet/studentRegistration.csv')
student_vle_data_frame = pd.read_csv('anonymisedOUDataSet/studentVle.csv')
vle_data_frame = pd.read_csv('anonymisedOUDataSet/vle.csv')

### Assessments

* code_module – identification code of the module, to which the assessment belongs.
* code_presentation - identification code of the presentation, to which the assessment belongs.
* id_assessment – identification number of the assessment.
* assessment_type – type of assessment. Three types of assessments exist: Tutor Marked Assessment (TMA), Computer Marked Assessment (CMA) and Final Exam (Exam).
* date – information about the final submission date of the assessment calculated as the number of days since the start of the module-presentation. The starting date of the presentation has number 0 (zero).
* weight - weight of the assessment in %. Typically, Exams are treated separately and have the weight 100%; the sum of all other assessments is 100%.

If the information about the final exam date is missing, it is at the end of the last presentation week.

In [3]:
assessments_data_frame.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [4]:
assessments_data_frame.count()

code_module          206
code_presentation    206
id_assessment        206
assessment_type      206
date                 195
weight               206
dtype: int64

### Courses

* code_module – code name of the module, which serves as the identifier.
* code_presentation – code name of the presentation. It consists of the year and “B” for the presentation starting in February and “J” for the presentation starting in October.
* length - length of the module-presentation in days.

The structure of B and J presentations may differ and therefore it is good practice to analyse the B and J presentations separately. Nevertheless, for some presentations the corresponding previous B/J presentation do not exist and therefore the J presentation must be used to inform the B presentation or vice versa. In the dataset this is the case of CCC, EEE and GGG modules.

In [5]:
courses_data_frame.head()

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [6]:
courses_data_frame.count()

code_module                   22
code_presentation             22
module_presentation_length    22
dtype: int64

### Student Assessments

* id_assessment – the identification number of the assessment.
* id_student – a unique identification number for the student.
* date_submitted – the date of student submission, measured as the number of days since the start of the module presentation.
* is_banked – a status flag indicating that the assessment result has been transferred from a previous presentation.
* score – the student’s score in this assessment. The range is from 0 to 100. The score lower than 40 is interpreted as Fail. The marks are in the range from 0 to 100.

In [7]:
student_assessments_data_frame.head()

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

In [8]:
student_assessments_data_frame.count()

id_assessment     173912
id_student        173912
date_submitted    173912
is_banked         173912
score             173739
dtype: int64

### Student Info

* code_module – an identification code for a module on which the student is registered.
* code_presentation - the identification code of the presentation during which the student is registered on the module.
* id_student – a unique identification number for the student.
* gender – the student’s gender.
* region – identifies the geographic region, where the student lived while taking the module-presentation.
* highest_education – highest student education level on entry to the module presentation.
* imd_band – specifies the Index of Multiple Depravation band of the place where the student lived during the module-presentation.
* age_band – band of the student’s age.
* num_of_prev_attempts – the number times the student has attempted this module.
* studied_credits – the total number of credits for the modules the student is currently studying.
* disability – indicates whether the student has declared a disability.
* final_result – student’s final result in the module-presentation.

In [9]:
student_info_data_frame.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

In [10]:
student_info_data_frame.count()

code_module             32593
code_presentation       32593
id_student              32593
gender                  32593
region                  32593
highest_education       32593
imd_band                31482
age_band                32593
num_of_prev_attempts    32593
studied_credits         32593
disability              32593
final_result            32593
dtype: int64

### Student Registration

* code_module – an identification code for a module.
* code_presentation - the identification code of the presentation.
* id_student – a unique identification number for the student.
* date_registration – the date of student’s registration on the module presentation, this is the number of days measured relative to the start of the module-presentation (e.g. the negative value -30 means that the student registered to module presentation 30 days before it started).
* date_unregistration – date of student unregistration from the module presentation, this is the number of days measured relative to the start of the module-presentation. Students, who completed the course have this field empty. Students who unregistered have Withdrawal as the value of the final_result column in the studentInfo.csv file.

In [11]:
student_registration_data_frame.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

### Student VLE

* code_module – an identification code for a module.
* code_presentation - the identification code of the module presentation.
* id_student – a unique identification number for the student.
* id_site - an identification number for the VLE material.
* date – the date of student’s interaction with the material measured as the number of days since the start of the module-presentation.
* sum_click – the number of times a student interacts with the material in that day.

In [12]:
student_vle_data_frame.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

### VLE

* id_site – an identification number of the material.
* code_module – an identification code for module.
* code_presentation - the identification code of presentation.
* activity_type – the role associated with the module material.
* week_from – the week from which the material is planned to be used.
* week_to – week until which the material is planned to be used.

In [13]:
vle_data_frame.head()

   id_site code_module code_presentation activity_type  week_from  week_to
0   546943         AAA             2013J      resource        NaN      NaN
1   546712         AAA             2013J     oucontent        NaN      NaN
2   546998         AAA             2013J      resource        NaN      NaN
3   546888         AAA             2013J           url        NaN      NaN
4   547035         AAA             2013J      resource        NaN      NaN

In [14]:
vle_data_frame.count()

id_site              6364
code_module          6364
code_presentation    6364
activity_type        6364
week_from            1121
week_to              1121
dtype: int64

In [15]:
vle_data_frame['activity_type'].unique()

array(['resource', 'oucontent', 'url', 'homepage', 'subpage', 'glossary',
       'forumng', 'oucollaborate', 'dataplus', 'quiz', 'ouelluminate',
       'sharedsubpage', 'questionnaire', 'page', 'externalquiz', 'ouwiki',
       'dualpane', 'repeatactivity', 'folder', 'htmlactivity'],
      dtype=object)

### Basic Statistics

In [16]:
df_course_stats = pd.DataFrame(student_info_data_frame.groupby(['code_module','code_presentation'], as_index=False).size(), columns=['student_count'])

In [17]:
# Student count in each course
df_course_stats

                               student_count
code_module code_presentation
AAA         2013J                        383
            2014J                        365
BBB         2013B                       1767
            2013J                       2237
            2014B                       1613
            2014J                       2292
CCC         2014B                       1936
            2014J                       2498
DDD         2013B                       1303
            2013J                       1938
            2014B                       1228
            2014J                       1803
EEE         2013J                       1052
            2014B                        694
            2014J                       1188
FFF         2013B                       1614
            2013J                       2283
            2014B                       1500
            2014J                       2365
GGG         2013J                        952
            2014B                        833
            2014J                        749

#### Average score for each student

In [18]:
temp = student_assessments_data_frame.groupby(["id_student"], as_index=False)
mean_df = pd.DataFrame(temp["score"].mean())

In [19]:
mean_df

       id_student      score
0            6516  61.800000
1            8462  87.000000
2           11391  82.000000
3           23629  82.500000
4           23698  74.444444
...           ...        ...
23364     2698251  58.142857
23365     2698257  67.800000
23366     2698535  39.250000
23367     2698577  64.400000
23368     2698588  92.400000

[23369 rows x 2 columns]

In [21]:
student_vle_data_frame.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

#### Sum clicks for each student in resource type

In [24]:
temp = student_vle_data_frame.loc[student_vle_data_frame["id_student"]==28400]
temp = 
#df_ass.loc[df_ass['assessment_name'] == assessment_name]

       code_module code_presentation  id_student  id_site  date  sum_click
0              AAA             2013J       28400   546652   -10          4
1              AAA             2013J       28400   546652   -10          1
2              AAA             2013J       28400   546652   -10          1
3              AAA             2013J       28400   546614   -10         11
4              AAA             2013J       28400   546714   -10          1
...            ...               ...         ...      ...   ...        ...
165286         AAA             2013J       28400   546649   224          1
165287         AAA             2013J       28400   546654   224          2
165288         AAA             2013J       28400   546614   224          3
165740         AAA             2013J       28400   546614   225          1
174007         AAA             2013J       28400   546614   239          1

[430 rows x 6 columns]